Revit 2026 API

# FilterOperatorAndTextString Class

---

An instance of this class holds a filter operator and a text string that denotes the operator in a particular context. For example, the text string for ScheduleFilterType::LessThan may be "is less than" for a filter rule based on a parameter with numerical values or "is below" for a filter rule based on a parameter representing a Level.

SystemObject Autodesk.Revit.DBFilterOperatorAndTextString

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterOperatorAndTextString : IDisposable
```
```vb
Public Class FilterOperatorAndTextString
	Implements IDisposable
```
```cpp
public ref class FilterOperatorAndTextString : IDisposable
```
```fsharp
type FilterOperatorAndTextString =
    class
        interface IDisposable
    end
```

The FilterOperatorAndTextString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterOperatorStr | A text string denoting the filter operator. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OperatorType | The filter operator. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilterOperatorAndTextString |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace